controllers/LoanController.php

SELECT * FROM `equipment` WHERE `id`='8'
SELECT * FROM `borrower` WHERE `id`='1'
SELECT EXISTS(SELECT * FROM `borrower` WHERE `borrower`.`id`='1')
SELECT EXISTS(SELECT * FROM `equipment` WHERE `equipment`.`id`='8')
SELECT EXISTS(SELECT * FROM `loan` WHERE (`equipment_id`='8') AND (`returned_at` IS NULL))
INSERT INTO `loan` (`equipment_id`, `borrower_id`, `loaned_at`, `due_at`, `note`, `created_at`) VALUES (8, 1, '2026-08-20', '2026-08-26', '', '2026-08-26 12:43:23')
UPDATE `equipment` SET `status`=1 WHERE `id`=8
---
    public function actionCreate()
    {
        $model = new LoanForm(['equipment_id' => Yii::$app->request->get('equipment_id'), 'loaned_at' => date('Y-m-d'), 'due_at' => date('Y-m-d', strtotime('+7 days'))]);
        if ($model->load(Yii::$app->request->post()) && $model->validate()) {
            $transaction = Yii::$app->db->beginTransaction();
            try {
                $equipment = Equipment::find()
                    ->where(['id' => $model->equipment_id])
                    ->one();
                $borrower = Borrower::find()
                    ->where(['id' => $model->borrower_id])
                    ->one();
                if (!$equipment || $equipment->status !== Equipment::STATUS_AVAILABLE ||
                    !$borrower || !$borrower->is_active ||
                    Loan::find()
                        ->where(['borrower_id' => $model->borrower_id, 'returned_at' => null])
                        ->count() >= Loan::MAX_OPEN_LOANS_PER_BORROWER ||
                    Loan::find()
                        ->where(['equipment_id' => $model->equipment_id, 'returned_at' => null])
                        ->exists()) {
                    throw new \DomainException('Az eszköz vagy a kölcsönvevő állapota közben megváltozott.');
                }

                $loan = new Loan();
                $loan->setAttributes($model->attributes);
                $loan->created_at = date('Y-m-d H:i:s');
                if (!$loan->save()) {
                    throw new \DomainException(implode(' ', $loan->getFirstErrors()));
                }
                $equipment->status = Equipment::STATUS_LOANED;
                if (!$equipment->save(false, ['status'])) {

SELECT * FROM `equipment` WHERE `status`=0 ORDER BY `name`
SELECT * FROM `borrower` WHERE `is_active`=TRUE ORDER BY `full_name`
---

        return $this->render('create', [
            'model' => $model,
            'equipmentOptions' => Equipment::find()->where(['status' => Equipment::STATUS_AVAILABLE])->orderBy(['name' => SORT_ASC])->all(),
            'borrowerOptions' => Borrower::find()->where(['is_active' => true])->orderBy(['full_name' => SORT_ASC])->all(),

SELECT * FROM `loan` WHERE `id`='15'
SELECT * FROM `equipment` WHERE `id`=8
UPDATE `loan` SET `returned_at`='2026-08-26' WHERE `id`=15
UPDATE `equipment` SET `status`=0 WHERE `id`=8
---
    public function actionReturn($id)
    {
        if (!Yii::$app->request->isPost) {
            throw new NotFoundHttpException();
        }
        $transaction = Yii::$app->db->beginTransaction();
        try {
            $loan = Loan::find()
                ->where(['id' => $id])
                ->one();
            if (!$loan || !$loan->isOpen()) {
                throw new \DomainException('A kölcsönzés már le van zárva vagy nem található.');
            }

            $equipment = Equipment::find()
                ->where(['id' => $loan->equipment_id])
                ->one();
            if (!$equipment) {
                throw new \DomainException('A kölcsönzéshez tartozó eszköz nem található.');
            }

            $loan->returned_at = date('Y-m-d');
            if (!$loan->save(false, ['returned_at'])) {
                throw new \DomainException('A visszavétel mentése sikertelen.');
            }
            $equipment->status = Equipment::STATUS_AVAILABLE;
            if (!$equipment->save(false, ['status'])) {