models/LoanForm.php

    public function validateSz3($attribute, $params)
    {
        if (!$this->equipment_id) {
            return;
        }
        $equipment = Equipment::findOne($this->equipment_id);
        if (!$equipment) {
            $this->addError($attribute, 'A kiválasztott eszköz nem található.');
        } elseif ($equipment->status !== Equipment::STATUS_AVAILABLE) {
            $this->addError($attribute, 'Az eszköz nem elérhető (kiadva, karbantartásban vagy selejtezve).');
        } elseif (Loan::find()->where(['equipment_id' => $equipment->id, 'returned_at' => null])->exists()) {
---
SELECT * FROM `equipment` WHERE `id`='8'
SELECT EXISTS(SELECT * FROM `loan` WHERE (`equipment_id`=8) AND (`returned_at` IS NULL))

    public function validateSz4($attribute, $params)
    {
        if (!$this->borrower_id) {
            return;
        }
        $borrower = Borrower::findOne($this->borrower_id);
        if (!$borrower) {
            $this->addError($attribute, 'A kölcsönvevő nem található.');
        } elseif (!$borrower->is_active) {
            $this->addError($attribute, 'A kölcsönvevő inaktív.');
        } elseif (Loan::find()
            ->where(['borrower_id' => $borrower->id, 'returned_at' => null])
            ->count() >= Loan::MAX_OPEN_LOANS_PER_BORROWER) {
---
SELECT * FROM `borrower` WHERE `id`='1'
SELECT COUNT(*) FROM `loan` WHERE (`borrower_id`=1) AND (`returned_at` IS NULL)